isliulin/leidalora/bsp/stm32f207VC_tw705/app_712/gps/gps.c
/************************************************************
 * Copyright (C), 2008-2012,
 * FileName:		// 文件名
 * Author:			// 作者
 * Date:			// 日期
 * Description:		// 模块描述
 * Version:			// 版本信息
 * Function List:	// 主要函数及其功能
 *     1. -------
 * History:			// 历史修改记录
 *     <author>  <time>   <version >   <desc>
 *     David    96/10/12     1.0     build this moudle
 ***********************************************************/
#include <stdio.h>
#include <rtthread.h>
#include <rtdevice.h>

#include "stm32f2xx.h"
#include "gps.h"
#include "App_moduleConfig.h"

#include <finsh.h>

#define GPS_PWR_PORT	GPIOD
#define GPS_PWR_PIN		GPIO_Pin_10

#define GPS_GPIO_TX			GPIO_Pin_12 // PC12
#define GPS_GPIO_RX			GPIO_Pin_2  // PD2
#define GPS_GPIO_TxC		GPIOC
#define GPS_GPIO_RxD		GPIOD
#define RCC_APBPeriph_UART5 RCC_APB1Periph_UART5

/*声明一个gps设备*/
static struct rt_device dev_gps;

/*串口接收缓存区定义*/
#define UART5_RX_SIZE 256

#define GPS_RAWINFO_SIZE    2048
#define  NMEA_SEGlength     128


#define  GPS_V_LIMIT         500  // 500s       

typedef __packed struct
{
    uint16_t	wr;
    uint8_t		body[UART5_RX_SIZE];
} LENGTH_BUF;

static LENGTH_BUF uart5_rxbuf;
static LENGTH_BUF gps_rx;
//static uint8_t	uart5_rxbuf[UART5_RX_SIZE];	/*预留前两个字节，保存长度*/
//static uint16_t uart5_rxbuf_wr = 2;

/*gps原始信息数据区定义*/
static struct rt_messagequeue	mq_gps;

uint8_t							flag_bd_upgrade_uart = 0;

//---------------------
static   u8   gps_rawinfo[GPS_RAWINFO_SIZE];
//---------------------



//==========================

/*  RT_thread    应用相关*/
u8	 systemTick_TriggerGPS = 1; //	触发系统时间定时发送GPS标志    默认启动本地定时
u16  systemTick_trigGPS_counter = 0; //触发系统定时下的时间计数器


const char BD_MODE[] = {"$CCSIR,1,0*49\r\n"};
const char GPS_MODE[] = {"$CCSIR,2,0*4A\r\n"};
const char GPSBD_MODE[] = {"$CCSIR,3,0*4B\r\n"};

GPSSTATUS    GpsStatus;
GPS_ABNORMAL   Gps_Exception;  // gps  模块异常处理
POS_ASC Posit_ASCII;  // 位置信息 ASCII
//==========================
static rt_err_t dev_gps_init( rt_device_t dev );


void GPS_Abnormal_init(void)
{
    Gps_Exception.current_datacou = 0;
    Gps_Exception.no_updateTimer = 0;
    Gps_Exception.last_datacou = 0;
    Gps_Exception.GPS_Rst_counter = 0;
    Gps_Exception.Reset_gps = 0;
    Gps_Exception.GPS_V_counter = 0;
}

//    GPS  长期保持 V  处理
void  GPS_Keep_V_timer(void)
{
    if(((Warn_Status[3] & 0x60) == 0x00) && (UDP_dataPacket_flag == 0x03) ) // 在天线状态正常情况下 判断V
    {
        Gps_Exception.GPS_V_counter++;
        if(Gps_Exception.GPS_V_counter == GPS_V_LIMIT)
        {
            gps_onoff(0);
        }
        if(Gps_Exception.GPS_V_counter >= (GPS_V_LIMIT + 3))
        {
            gps_onoff(1);  // Gps module Power on	GPS 模块开电
            Gps_Exception.GPS_V_counter = 0;
            //  rt_kprintf("\r\n gps long v  recover power\r\n");
        }
    }
    else if(UDP_dataPacket_flag == 0x02)
    {
        Gps_Exception.GPS_V_counter = 0;
    }

}

void  GPS_Abnormal_process(void)
{
    //----------GPS 异常情况处理-----------------------
    Gps_Exception.no_updateTimer++;
    if( Gps_Exception.no_updateTimer >= 300)
    {
        Gps_Exception.no_updateTimer = 0;
        if(Gps_Exception.Reset_gps == 1)
        {
            Gps_Exception.Reset_gps = 0;
            gps_onoff(1); // GPS power on
            Gps_Exception.GPS_Rst_counter++;
            if(Gps_Exception.GPS_Rst_counter > 5)
            {
                Gps_Exception.GPS_Rst_counter = 0;
            }
        }
        else
        {
            if(Gps_Exception.current_datacou - Gps_Exception.last_datacou < 300)
            {
                gps_onoff(0); //GPS  power off
                Gps_Exception.Reset_gps = 1;
                //---------断电就置为不定位 -----------------
                Car_Status[3] &= ~0x02; //Bit(1)
                ModuleStatus &= ~Status_GPS;
                GPS_getfirst = 0;
                //-------------------------------------------
            }
            else
            {
                Gps_Exception.last_datacou = 0;
                Gps_Exception.current_datacou = 0;
            }
        }
    }




}


//$GPRMC,063835.00,A,3909.11361,N,11712.50398,E,0.192,150.85,110305,,,A*64
//$GPRMC,063835.00,A,4000.81000,N,11556.40000,E,0.192,150.85,110305,,,A*64
//$GNRMC,125146.000,V,0000.0000,N,00000.0000,E,0.0,,080614,,E,N*0D


u8 Process_RMC(u8 *packet)
{
    u8  CommaCount = 0, iCount = 0, k = 0;
    u8  tmpinfo[15]; // 新版本的北斗模块经度更高了
    //$GNRMC,085928.00,A,3920.020977,N,11744.385579,E,0.7,,020113,,,A*67
    //$GNRMC,090954.00,A,3920.024800,N,11744.384457,E,0.3,,020113,,,A*65
    //           11744.385579
    u8  hour = 0, min = 0, sec = 0, fDateModify = 0;


	uint8_t  year = 0, mon = 0, day = 0;
	TDateTime now, now_bak;
	int i = 0;
				

    //-------------------------------------------------------------------
    while (*packet != 0)
    {
        if(*packet == ',')
        {
            CommaCount++;
            packet++;
            if(iCount == 0) continue;
            switch(CommaCount)
            {
            case 2: //时间
                //systemTickGPS_Set();
                if ( iCount < 6 ) 	  //  格式检查
                {
                    return false;
                }

                if((tmpinfo[0] >= 0x30) && (tmpinfo[0] <= 0x39) && (tmpinfo[1] >= 0x30) && (tmpinfo[1] <= 0x39) && (tmpinfo[2] >= 0x30) && (tmpinfo[2] <= 0x39) && (tmpinfo[3] >= 0x30) && (tmpinfo[3] <= 0x39) && (tmpinfo[4] >= 0x30) && (tmpinfo[4] <= 0x39) && (tmpinfo[5] >= 0x30) && (tmpinfo[5] <= 0x39))
                    ;
                else
                {
                    return false;
                }


                hour = (tmpinfo[0] - 0x30) * 10 + (tmpinfo[1] - 0x30) + 8;
                min = (tmpinfo[2] - 0x30) * 10 + (tmpinfo[3] - 0x30);
                sec = (tmpinfo[4] - 0x30) * 10 + (tmpinfo[5] - 0x30);
                if(hour > 23)
                {
                    fDateModify = 1;
                    hour -= 24;
                    tmpinfo[0] = (hour / 10) + '0';
                    tmpinfo[1] = (hour % 10) + '0';
                }
                //systemTickGPS_Clear();
                break;
            case 3://数据有效性
				 if ( tmpinfo[0] == 'V' || tmpinfo[0] == 'v' )
				    {
				        UDP_dataPacket_flag = 'V';
				    }
				    else if ( tmpinfo[0] == 'A' || tmpinfo[0] == 'a' )
				    {
				        UDP_dataPacket_flag =  'A';
				    }
                break;
            case 4://纬度
                break;
            case 5://纬度半球
                break;
            case 6://经度
                break;
            case 7://经度半球
                break;
            case 8://速率
                break;
            case 9://方向

                break;
            case 10://日期
                if((tmpinfo[0] >= 0x30) && (tmpinfo[0] <= 0x39) && (tmpinfo[1] >= 0x30) && (tmpinfo[1] <= 0x39) && (tmpinfo[2] >= 0x30) && (tmpinfo[2] <= 0x39) && (tmpinfo[3] >= 0x30) && (tmpinfo[3] <= 0x39) && (tmpinfo[4] >= 0x30) && (tmpinfo[4] <= 0x39) && (tmpinfo[5] >= 0x30) && (tmpinfo[5] <= 0x39))
                    ;
                else
                    break;
                //---------
          
				
				   day = (( tmpinfo[0] - 0x30 ) * 10 ) + ( tmpinfo[1] - 0x30 );
				   mon = (( tmpinfo[2] - 0x30 ) * 10 ) + ( tmpinfo[3] - 0x30 );
				   year = (( tmpinfo[4] - 0x30 ) * 10 ) + ( tmpinfo[5] - 0x30 );
				
				   if(fDateModify)
				   {
					   //sscanf(tmpinfo,"%2d%2d%2d",&day,&mon,&year);
					   day++;
					   if(mon == 2)
					   {
						   if ( ( year % 4 ) == 0 )
						   {
							   if ( day == 30 )
							   {
								   day = 1;
								   mon++;
							   }
						   }
						   else if ( day == 29 )
						   {
							   day = 1;
							   mon++;
						   }
					   }
					   else if (( mon == 4 ) || ( mon == 6 ) || ( mon == 9 ) || ( mon == 11 ))
					   {
						   if ( day == 31 )
						   {
							   mon++;
							   day = 1;
						   }
					   }
					   else
					   {
						   if ( day == 32 )
						   {
							   mon++;
							   day = 1;
						   }
						   if( mon == 13 )
						   {
							   mon = 1;
							   year++;
						   }
					   }
				   }

				//--------
				time_now.year=year;
				time_now.month=mon;
				time_now.day=day;

				time_now.hour=hour;
				time_now.min=min;
				time_now.sec=sec;
                break;
            default:
                break;
            }
            iCount = 0;
        }
        else
        {
            tmpinfo[iCount++] = *packet++;
            if(iCount < 15)
                tmpinfo[iCount] = 0;
            if(iCount > 15)
            {
                //return CommaCount;
                break;
            }
        }
    }
    return CommaCount;
}

//----------------
u8 Process_GSA(u8 *packet)
{

