isliulin/leidalora/bsp/stm32f207VC_tw705/app_712/gps/gps.c
//================================================



void GpsIo_Init(void)
{
    GPIO_InitTypeDef	GPIO_InitStructure;
    NVIC_InitTypeDef	NVIC_InitStructure;

    RCC_AHB1PeriphClockCmd( RCC_AHB1Periph_GPIOC, ENABLE );
    RCC_AHB1PeriphClockCmd( RCC_AHB1Periph_GPIOD, ENABLE );
    RCC_APB1PeriphClockCmd( RCC_APB1Periph_UART5, ENABLE );

    GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_OUT;
    GPIO_InitStructure.GPIO_OType	= GPIO_OType_PP;
    GPIO_InitStructure.GPIO_PuPd	= GPIO_PuPd_NOPULL;
    GPIO_InitStructure.GPIO_Speed	= GPIO_Speed_50MHz;

    GPIO_InitStructure.GPIO_Pin = GPS_PWR_PIN;
    GPIO_Init( GPS_PWR_PORT, &GPIO_InitStructure );
    GPIO_ResetBits( GPS_PWR_PORT, GPS_PWR_PIN );

    /*uart5 管脚设置*/

    GPIO_InitStructure.GPIO_OType	= GPIO_OType_PP;
    GPIO_InitStructure.GPIO_PuPd	= GPIO_PuPd_UP;
    GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_AF;
    GPIO_InitStructure.GPIO_Speed	= GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Pin		= GPIO_Pin_12;
    GPIO_Init( GPIOC, &GPIO_InitStructure );

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
    GPIO_Init( GPIOD, &GPIO_InitStructure );

    GPIO_PinAFConfig( GPIOC, GPIO_PinSource12, GPIO_AF_UART5 );
    GPIO_PinAFConfig( GPIOD, GPIO_PinSource2, GPIO_AF_UART5 );

    /*NVIC 设置*/
    NVIC_InitStructure.NVIC_IRQChannel						= UART5_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority	= 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority			= 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd					= ENABLE;
    NVIC_Init( &NVIC_InitStructure );

    gps_baud( 9600 );
    USART_Cmd( UART5, ENABLE );
    USART_ITConfig( UART5, USART_IT_RXNE, ENABLE );

    GPIO_SetBits( GPIOD, GPIO_Pin_10 );


    //------------------- PD9 -----------------------------
    GPIO_InitStructure.GPIO_Pin	= GPIO_Pin_9;   // 功放
    GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_OUT;
    GPIO_Init(GPIOD, &GPIO_InitStructure);

}





/*
   gps接收中断处理，收到\n认为收到一包
   收到一包调用处理函数
 */
static uint8_t	last_ch = 0;
void UART5_IRQHandler( void )
{
    uint8_t			ch;
    rt_interrupt_enter( );
    if( USART_GetITStatus( UART5, USART_IT_RXNE ) != RESET )
    {
        ch = USART_ReceiveData( UART5 );
        if( ( ch == 0x0a ) && ( last_ch == 0x0d ) ) /*遇到0d 0a 表明结束*/
        {
            uart5_rxbuf.body[uart5_rxbuf.wr++] = ch;
            if( uart5_rxbuf.wr < 124 )
            {
                //--------- fliter  useful------
                if((strncmp((char *)uart5_rxbuf.body + 3, "RMC,", 4) == 0) || (strncmp((char *)uart5_rxbuf.body + 3, "TXT,", 4) == 0) ||  \
                        (strncmp((char *)uart5_rxbuf.body + 3, "GGA,", 4) == 0)) //||(strncmp((char*)uart5_rxbuf.body+3,"GSA,",4)==0))
                {
                    rt_mq_send( &mq_gps, (void *)&uart5_rxbuf, uart5_rxbuf.wr + 2 );
                }
            }
            uart5_rxbuf.wr = 0;
        }
        else
        {
            // 1. get  head char
            if(ch == '$')
                uart5_rxbuf.wr = 0;
            // 2.  judge  head char
            if(uart5_rxbuf.body[0] != '$') // add later
                uart5_rxbuf.wr = 0;
            // 3.  rx data
            uart5_rxbuf.body[uart5_rxbuf.wr++] = ch;
            if( uart5_rxbuf.wr == UART5_RX_SIZE )
            {
                uart5_rxbuf.wr = 0;
            }
            uart5_rxbuf.body[uart5_rxbuf.wr] = 0;
        }
        last_ch = ch;
        USART_ClearITPendingBit( UART5, USART_IT_RXNE );
    }
    rt_interrupt_leave( );
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void gps_baud( int baud )
{
    USART_InitTypeDef USART_InitStructure;
    USART_InitStructure.USART_BaudRate				= baud;
    USART_InitStructure.USART_WordLength			= USART_WordLength_8b;
    USART_InitStructure.USART_StopBits				= USART_StopBits_1;
    USART_InitStructure.USART_Parity				= USART_Parity_No;
    USART_InitStructure.USART_HardwareFlowControl	= USART_HardwareFlowControl_None;
    USART_InitStructure.USART_Mode					= USART_Mode_Rx | USART_Mode_Tx;
    USART_Init( UART5, &USART_InitStructure );
}

//FINSH_FUNCTION_EXPORT( gps_baud, config gsp_baud );


/*初始化*/

void  gps_io_init(void)
{
    GPIO_InitTypeDef	GPIO_InitStructure;
    RCC_AHB1PeriphClockCmd( RCC_AHB1Periph_GPIOD, ENABLE );
#if 1
    //-------- 开短路检测  --------
    //#ifdef HC_595_CONTROL
    // 2013-4-20		更改PCB   用PD4 : GPS 天线开路		PB6 : GPS  天线短路
    GPIO_InitStructure.GPIO_OType   = GPIO_OType_PP;
    GPIO_InitStructure.GPIO_PuPd	  = GPIO_PuPd_NOPULL;
    GPIO_InitStructure.GPIO_Speed   = GPIO_Speed_2MHz;
    //	 IN
    //------------------- PD4 -----------------------------
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4;    //GPS 天线开路
    GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_IN;
    GPIO_Init(GPIOD, &GPIO_InitStructure);
    //------------------- PB6 -----------------------------
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;    //GPS 天线短路
    GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_IN;
    GPIO_Init(GPIOB, &GPIO_InitStructure);
#endif

}


/*初始化*/
static rt_err_t dev_gps_init( rt_device_t dev )
{
    GPIO_InitTypeDef	GPIO_InitStructure;
    NVIC_InitTypeDef	NVIC_InitStructure;

    RCC_AHB1PeriphClockCmd( RCC_AHB1Periph_GPIOC, ENABLE );
    RCC_AHB1PeriphClockCmd( RCC_AHB1Periph_GPIOD, ENABLE );
    RCC_APB1PeriphClockCmd( RCC_APB1Periph_UART5, ENABLE );

    GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_OUT;
    GPIO_InitStructure.GPIO_OType	= GPIO_OType_PP;
    GPIO_InitStructure.GPIO_PuPd	= GPIO_PuPd_NOPULL;
    GPIO_InitStructure.GPIO_Speed	= GPIO_Speed_50MHz;

    GPIO_InitStructure.GPIO_Pin = GPS_PWR_PIN;
    GPIO_Init( GPS_PWR_PORT, &GPIO_InitStructure );
    GPIO_ResetBits( GPS_PWR_PORT, GPS_PWR_PIN );



    /*uart5 管脚设置*/

    GPIO_InitStructure.GPIO_OType	= GPIO_OType_PP;
    GPIO_InitStructure.GPIO_PuPd	= GPIO_PuPd_UP;
    GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_AF;
    GPIO_InitStructure.GPIO_Speed	= GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Pin		= GPIO_Pin_12;
    GPIO_Init( GPIOC, &GPIO_InitStructure );

