isliulin/leidalora/bsp/stm32f207VC_tw705/app_712/gps/gps.c
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
    GPIO_Init( GPIOD, &GPIO_InitStructure );

    GPIO_PinAFConfig( GPIOC, GPIO_PinSource12, GPIO_AF_UART5 );
    GPIO_PinAFConfig( GPIOD, GPIO_PinSource2, GPIO_AF_UART5 );

    /*NVIC 设置*/
    NVIC_InitStructure.NVIC_IRQChannel						= UART5_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority	= 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority			= 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd					= ENABLE;
    NVIC_Init( &NVIC_InitStructure );

    gps_baud( 9600 );
    USART_Cmd( UART5, ENABLE );
    USART_ITConfig( UART5, USART_IT_RXNE, ENABLE );

    GPIO_SetBits( GPIOD, GPIO_Pin_10 );



    return RT_EOK;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static rt_err_t dev_gps_open( rt_device_t dev, rt_uint16_t oflag )
{
    GPIO_SetBits( GPS_PWR_PORT, GPS_PWR_PIN );
    return RT_EOK;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static rt_err_t dev_gps_close( rt_device_t dev )
{
    GPIO_ResetBits( GPS_PWR_PORT, GPS_PWR_PIN );
    return RT_EOK;
}

/***********************************************************
* Function:gps_read
* Description:数据模式下读取数据
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static rt_size_t dev_gps_read( rt_device_t dev, rt_off_t pos, void *buff, rt_size_t count )
{
    return RT_EOK;
}

/***********************************************************
* Function:		gps_write
* Description:	数据模式下发送数据，要对数据进行封装
* Input:		const void* buff	要发送的原始数据
       rt_size_t count	要发送数据的长度
       rt_off_t pos		使用的socket编号
* Output:
* Return:
* Others:
***********************************************************/

static rt_size_t dev_gps_write( rt_device_t dev, rt_off_t pos, const void *buff, rt_size_t count )
{
    rt_size_t	len = count;
    uint8_t		*p	= (uint8_t *)buff;

    while( len )
    {
        USART_SendData( UART5, *p++ );
        while( USART_GetFlagStatus( UART5, USART_FLAG_TC ) == RESET )
        {
        }
        len--;
    }
    return RT_EOK;
}

/***********************************************************
* Function:		gps_control
* Description:	控制模块
* Input:		rt_uint8_t cmd	命令类型
    void *arg       参数,依据cmd的不同，传递的数据格式不同
* Output:
* Return:
* Others:
***********************************************************/
static rt_err_t dev_gps_control( rt_device_t dev, rt_uint8_t cmd, void *arg )
{
    int i = *(int *)arg;
    switch( cmd )
    {
    case CTL_GPS_OUTMODE:
        break;
    case CTL_GPS_BAUD:
        gps_baud( i );
    }
    return RT_EOK;
}

ALIGN( RT_ALIGN_SIZE )
static char thread_gps_stack[4096];
struct rt_thread thread_gps;


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static void rt_thread_entry_gps( void *parameter )
{
    rt_err_t	res;

    // 1.  init
    GPS_Abnormal_init();

    //2.  main while
    while( 1 )
    {
        // 1. rx data
        res = rt_mq_recv( &mq_gps, (void *)&gps_rx, 124, 2 ); //等待100ms,实际上就是变长的延时,最长100ms
        if(res == RT_EOK )                                                    //收到一包数据
        {
            //---------------------------------
            if( flag_bd_upgrade_uart == 0 )
            {
                GPS_Rx_Process( gps_rx.body, gps_rx.wr );
                GPS_Abnormal_process();//  GPS 模块异常检测

            }
            else
            {
                if( gps_rx.body[0] == 0x40 )
                {
                    rt_device_write( &dev_vuart, 0, gps_rx.body, gps_rx.wr);
                }
            }
        }

        //2. GPS_ANTENNA_status
        GPS_ANTENNA_status();
        GPS_short_judge_timer();

        rt_thread_delay(30);
        gps_thread_runCounter = 0;
    }
}

/*gps设备初始化*/
void gps_init( void )
{
    //rt_sem_init( &sem_gps, "sem_gps", 0, 0 );

    rt_mq_init( &mq_gps, "mq_gps", &gps_rawinfo[0], 128 - sizeof( void * ), GPS_RAWINFO_SIZE, RT_IPC_FLAG_FIFO );
    rt_thread_init( &thread_gps,
                    "gps",
                    rt_thread_entry_gps,
                    RT_NULL,
                    &thread_gps_stack[0],
                    sizeof( thread_gps_stack ), Prio_GPS, 6 );
    rt_thread_startup( &thread_gps );

    dev_gps.type	= RT_Device_Class_Char;
    dev_gps.init	= dev_gps_init;
    dev_gps.open	= dev_gps_open;
    dev_gps.close	= dev_gps_close;
    dev_gps.read	= dev_gps_read;
    dev_gps.write	= dev_gps_write;
    dev_gps.control = dev_gps_control;

    rt_device_register( &dev_gps, "gps", RT_DEVICE_FLAG_RDWR | RT_DEVICE_FLAG_STANDALONE );
    rt_device_init( &dev_gps );
}

/*gps开关*/
rt_err_t gps_onoff( uint8_t openflag )
{
    if( openflag == 0 )
    {
        GPIO_ResetBits( GPIOD, GPIO_Pin_10 );
    }
    else
    {
        GPIO_SetBits( GPIOD, GPIO_Pin_10 );
    }
    return 0;
}

FINSH_FUNCTION_EXPORT( gps_onoff, gps_onoff([1 | 0] ) );

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
rt_size_t gps_write( uint8_t *p, uint8_t len )
{
    return dev_gps_write( &dev_gps, 0, p, len );
}

//FINSH_FUNCTION_EXPORT( gps_write, write to gps );



void  gps_mode(u8 *str)
{
    if (strlen((const char *)str) == 0)
    {
        rt_kprintf("\r\n    定位模式:    ");
        switch(GpsStatus.Position_Moule_Status)
        {
        case 1:
            rt_kprintf(" BD\r\n");
            break;
        case 2:
            rt_kprintf(" GPS\r\n");
            break;
        case 3:
            rt_kprintf(" BD+GPS\r\n");
            break;
        }
    }
    else
    {
        if(str[0] == '1')
        {
            dev_gps_write( &dev_gps, 0, BD_MODE, strlen((const char *)BD_MODE));
            GpsStatus.Position_Moule_Status = 1;
            //GPS_PutStr(BD_MODE);
            rt_kprintf ("\r\n    BD MODE\r\n");
        }
        else if(str[0] == '2')
        {
            dev_gps_write( &dev_gps, 0, GPS_MODE, strlen((const char *)BD_MODE));
            GpsStatus.Position_Moule_Status = 2;
            //GPS_PutStr(GPS_MODE);
            rt_kprintf("\r\n    GPS MODE\r\n");
        }
        else if(str[0] == '3')
        {
            dev_gps_write( &dev_gps, 0, GPSBD_MODE, strlen((const char *)BD_MODE));
            GpsStatus.Position_Moule_Status = 3;
            //GPS_PutStr(GPSBD_MODE);
            rt_kprintf("\r\n    GPS&BD MODE\r\n");
        }
    }
}
FINSH_FUNCTION_EXPORT(gps_mode, posit_mode setting);


void  gps_raw(u8 *str)
{
    if(str[0] == '1')
    {
        GpsStatus.Raw_Output = 1;
    }
    else if(str[0] == '2')
    {
        GpsStatus.Raw_Output = 2;
    }
    else if(str[0] == '0')
    {
        GpsStatus.Raw_Output = 0;
    }

}

FINSH_FUNCTION_EXPORT(gps_raw, gps raw output);

/************************************** The End Of File **************************************/

